package by.savik.L23_12_2024;
/*Задача 8: Квадраты чисел
        Напишите программу, которая выводит квадраты чисел от 1 до 20 с помощью цикла for.*/
public class Hmwrk10 {
    public static void main(String[] args) {
        for (int i = 1; i <=20; i++) {
            int a = i * i;
            System.out.print(a + " ");
        }
    }
}
